// -----------------------задание 3-----------------------------
// Написать функцию, которая принимает число как аргумент и возвращает функцию, которая также принимает 
// число как аргумент и возвращает сумму этих двух чисел. Выведите в консоль результат.


// -----------------------вариант 1-----------------------------

function firstFunc(a) {
return function secondFunc(b) {
return a + b;
}}
console.log(firstFunc(12)(6))

// -----------------------вариант 2-----------------------------

const func = (a) => (b) => a + b
console.log(func(3)(6))


//-----------------------вариант 3-----------------------------

function firstFun(a){
const func = (b) => {
return console.log(a + b)
}
func(6)
}
firstFun(4)

//-----------------------вариант 4-----------------------------

function firstFun(a){
function func(b) {
console.log(a + b)
}
func(9);
}
firstFun(4)